Below are my testing results:

**Terraform Version:**
```
johnsonryan@johnsonryan-a03 ~> terraform version
Terraform v1.0.6
on darwin_amd64
```

**vSphere Provider Version**

`provider registry.terraform.io/hashicorp/vsphere v2.0.2`

**vSphere Version**

`vSphere 7.0 U2c`

**Module**

```
  source                = "Terraform-VMWare-Modules/vm/vsphere"
  version               = "3.2.0"
```

**TEST WITH ROCKY LINUX 8**

- PACKER TEMPLATE: efi (no secure boot - not supported)
- RESULT: Deployed but the Guest OS Customization **does not** complete, as expected.
- NO crash.

`main.tf`

```
provider "vsphere" {
  user = "administrator@vsphere.local"
  password = "VMware1!"
  vsphere_server = "m01-vc01.rainpole.io"
  allow_unverified_ssl = true
}

data "vsphere_datacenter" "dc" {
  name = "m01-dc01"
}

data "vsphere_compute_cluster" "cluster" {
  name          = "m01-cl01"
  datacenter_id = "${data.vsphere_datacenter.dc.id}"
}

data "vsphere_datastore" "datastore" {
  name          = "local-hdd-01"
  datacenter_id = "${data.vsphere_datacenter.dc.id}"
}

data "vsphere_virtual_machine" "template" {
  name          = "rockylinux-template"
  datacenter_id = "${data.vsphere_datacenter.dc.id}"
}

module "vm" {
  source                = "Terraform-VMWare-Modules/vm/vsphere"
  version               = "3.2.0"
  dc                    = "m01-dc01"
  vmfolder              = "Lab"
  vmtemp                = "rockylinux-template"
  vmname                = "rocky"
  vmrp                  = "Lab"
  domain                = "rainpole.io"
  cpu_number            = "1"
  ram_size              = "4096"
  datastore             = "local-hdd-01"
  network = {
    "DHCP" = ["", ""]
  }
  ipv4submask = ["24"]
  network_type = ["vmxnet3"]
  
  data_disk = {
    disk1 = {
      size_gb = "40960",
      thin_provisioned = "true",
    }
  }
  dns_server_list = ["172.16.11.11"]
  vmgateway = "172.16.11.1"
  firmware  = "efi"
}
```

`terraform apply`

```
johnsonryan@johnsonryan-a03 ~/D/test> terraform apply --auto-approve

Terraform used the selected providers to generate the following execution plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # module.vm.vsphere_virtual_machine.vm[0] will be created
  + resource "vsphere_virtual_machine" "vm" {
      + boot_retry_delay                        = 10000
      + change_version                          = (known after apply)
      + cpu_limit                               = -1
      + cpu_share_count                         = (known after apply)
      + cpu_share_level                         = "normal"
      + datastore_id                            = "datastore-12"
      + default_ip_address                      = (known after apply)
      + efi_secure_boot_enabled                 = false
      + ept_rvi_mode                            = "automatic"
      + firmware                                = "efi"
      + folder                                  = "Lab"
      + force_power_off                         = true
      + guest_id                                = "centos8_64Guest"
      + guest_ip_addresses                      = (known after apply)
      + hardware_version                        = (known after apply)
      + host_system_id                          = (known after apply)
      + hv_mode                                 = "hvAuto"
      + id                                      = (known after apply)
      + ide_controller_count                    = 2
      + ignored_guest_ips                       = []
      + imported                                = (known after apply)
      + latency_sensitivity                     = "normal"
      + memory                                  = 4096
      + memory_limit                            = -1
      + memory_share_count                      = (known after apply)
      + memory_share_level                      = "normal"
      + migrate_wait_timeout                    = 30
      + moid                                    = (known after apply)
      + name                                    = "rocky01"
      + num_cores_per_socket                    = 1
      + num_cpus                                = 1
      + poweron_timeout                         = 300
      + reboot_required                         = (known after apply)
      + resource_pool_id                        = "resgroup-6053"
      + run_tools_scripts_after_power_on        = true
      + run_tools_scripts_after_resume          = true
      + run_tools_scripts_before_guest_shutdown = true
      + run_tools_scripts_before_guest_standby  = true
      + sata_controller_count                   = 0
      + scsi_bus_sharing                        = "noSharing"
      + scsi_controller_count                   = 1
      + scsi_type                               = "pvscsi"
      + shutdown_wait_timeout                   = 3
      + storage_policy_id                       = (known after apply)
      + swap_placement_policy                   = "inherit"
      + uuid                                    = (known after apply)
      + vapp_transport                          = (known after apply)
      + vmware_tools_status                     = (known after apply)
      + vmx_path                                = (known after apply)
      + wait_for_guest_ip_timeout               = 0
      + wait_for_guest_net_routable             = true
      + wait_for_guest_net_timeout              = 5

      + clone {
          + linked_clone  = false
          + template_uuid = "42024c79-f225-799d-4a07-3b99e9ec7a86"
          + timeout       = 30

          + customize {
              + dns_server_list = [
                  + "172.16.11.11",
                ]
              + ipv4_gateway    = "172.16.11.1"
              + timeout         = 10

              + linux_options {
                  + domain       = "rainpole.io"
                  + host_name    = "rocky01"
                  + hw_clock_utc = true
                }

              + network_interface {
                  + ipv4_netmask = 24
                }
            }
        }

      + disk {
          + attach            = false
          + controller_type   = "scsi"
          + datastore_id      = "<computed>"
          + device_address    = (known after apply)
          + disk_mode         = "persistent"
          + disk_sharing      = "sharingNone"
          + eagerly_scrub     = false
          + io_limit          = -1
          + io_reservation    = 0
          + io_share_count    = 0
          + io_share_level    = "normal"
          + keep_on_remove    = false
          + key               = 0
          + label             = "disk0"
          + path              = (known after apply)
          + size              = 40
          + storage_policy_id = (known after apply)
          + thin_provisioned  = false
          + unit_number       = 0
          + uuid              = (known after apply)
          + write_through     = false
        }
      + disk {
          + attach            = false
          + controller_type   = "scsi"
          + datastore_id      = "<computed>"
          + device_address    = (known after apply)
          + disk_mode         = "persistent"
          + disk_sharing      = "sharingNone"
          + eagerly_scrub     = false
          + io_limit          = -1
          + io_reservation    = 0
          + io_share_count    = 0
          + io_share_level    = "normal"
          + keep_on_remove    = false
          + key               = 0
          + label             = "disk1"
          + path              = (known after apply)
          + size              = 40960
          + storage_policy_id = (known after apply)
          + thin_provisioned  = true
          + unit_number       = 1
          + uuid              = (known after apply)
          + write_through     = false
        }

      + network_interface {
          + adapter_type          = "vmxnet3"
          + bandwidth_limit       = -1
          + bandwidth_reservation = 0
          + bandwidth_share_count = (known after apply)
          + bandwidth_share_level = "normal"
          + device_address        = (known after apply)
          + key                   = (known after apply)
          + mac_address           = (known after apply)
          + network_id            = "network-16"
        }
    }

Plan: 1 to add, 0 to change, 0 to destroy.
module.vm.vsphere_virtual_machine.vm[0]: Creating...
module.vm.vsphere_virtual_machine.vm[0]: Still creating... [10s elapsed]
module.vm.vsphere_virtual_machine.vm[0]: Still creating... [20s elapsed]
module.vm.vsphere_virtual_machine.vm[0]: Still creating... [30s elapsed]
module.vm.vsphere_virtual_machine.vm[0]: Still creating... [40s elapsed]
module.vm.vsphere_virtual_machine.vm[0]: Still creating... [50s elapsed]
module.vm.vsphere_virtual_machine.vm[0]: Still creating... [1m0s elapsed]
module.vm.vsphere_virtual_machine.vm[0]: Still creating... [1m10s elapsed]
module.vm.vsphere_virtual_machine.vm[0]: Still creating... [1m20s elapsed]
module.vm.vsphere_virtual_machine.vm[0]: Creation complete after 1m28s [id=4202667d-46aa-b485-557a-a0cc4f97e084]

Apply complete! Resources: 1 added, 0 changed, 0 destroyed.
```

------------

**TEST WITH ALMALINUX 8**

- PACKER TEMPLATE: efi-secure
- RESULT: Deployed but the Guest OS Customization **does not** complete, as expected.

`main.tf`

```
provider "vsphere" {
  user = "administrator@vsphere.local"
  password = "VMware1!"
  vsphere_server = "m01-vc01.rainpole.io"
  allow_unverified_ssl = true
}

data "vsphere_datacenter" "dc" {
  name = "m01-dc01"
}

data "vsphere_compute_cluster" "cluster" {
  name          = "m01-cl01"
  datacenter_id = "${data.vsphere_datacenter.dc.id}"
}

data "vsphere_datastore" "datastore" {
  name          = "local-hdd-01"
  datacenter_id = "${data.vsphere_datacenter.dc.id}"
}

data "vsphere_virtual_machine" "template" {
  name          = "almalinux-template"
  datacenter_id = "${data.vsphere_datacenter.dc.id}"
}

module "vm" {
  source                = "Terraform-VMWare-Modules/vm/vsphere"
  version               = "3.2.0"
  dc                    = "m01-dc01"
  vmfolder              = "Lab"
  vmtemp                = "almalinux-template"
  vmname                = "alma"
  vmrp                  = "Lab"
  domain                = "rainpole.io"
  cpu_number            = "1"
  ram_size              = "4096"
  datastore             = "local-hdd-01"
  network = {
    "DHCP" = ["", ""]
  }
  ipv4submask = ["24"]
  network_type = ["vmxnet3"]
  
  data_disk = {
    disk1 = {
      size_gb = "40960",
      thin_provisioned = "true",
    }
  }
  dns_server_list = ["172.16.11.11"]
  vmgateway = "172.16.11.1"
  firmware  = "efi"
}
```

`terraform apply`

```
johnsonryan@johnsonryan-a03 ~/D/test [1]> terraform apply --auto-approve

Terraform used the selected providers to generate the following execution plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # module.vm.vsphere_virtual_machine.vm[0] will be created
  + resource "vsphere_virtual_machine" "vm" {
      + boot_retry_delay                        = 10000
      + change_version                          = (known after apply)
      + cpu_limit                               = -1
      + cpu_share_count                         = (known after apply)
      + cpu_share_level                         = "normal"
      + datastore_id                            = "datastore-12"
      + default_ip_address                      = (known after apply)
      + efi_secure_boot_enabled                 = false
      + ept_rvi_mode                            = "automatic"
      + firmware                                = "efi"
      + folder                                  = "Lab"
      + force_power_off                         = true
      + guest_id                                = "other4xLinux64Guest"
      + guest_ip_addresses                      = (known after apply)
      + hardware_version                        = (known after apply)
      + host_system_id                          = (known after apply)
      + hv_mode                                 = "hvAuto"
      + id                                      = (known after apply)
      + ide_controller_count                    = 2
      + ignored_guest_ips                       = []
      + imported                                = (known after apply)
      + latency_sensitivity                     = "normal"
      + memory                                  = 4096
      + memory_limit                            = -1
      + memory_share_count                      = (known after apply)
      + memory_share_level                      = "normal"
      + migrate_wait_timeout                    = 30
      + moid                                    = (known after apply)
      + name                                    = "alma01"
      + num_cores_per_socket                    = 1
      + num_cpus                                = 1
      + poweron_timeout                         = 300
      + reboot_required                         = (known after apply)
      + resource_pool_id                        = "resgroup-6053"
      + run_tools_scripts_after_power_on        = true
      + run_tools_scripts_after_resume          = true
      + run_tools_scripts_before_guest_shutdown = true
      + run_tools_scripts_before_guest_standby  = true
      + sata_controller_count                   = 0
      + scsi_bus_sharing                        = "noSharing"
      + scsi_controller_count                   = 1
      + scsi_type                               = "pvscsi"
      + shutdown_wait_timeout                   = 3
      + storage_policy_id                       = (known after apply)
      + swap_placement_policy                   = "inherit"
      + uuid                                    = (known after apply)
      + vapp_transport                          = (known after apply)
      + vmware_tools_status                     = (known after apply)
      + vmx_path                                = (known after apply)
      + wait_for_guest_ip_timeout               = 0
      + wait_for_guest_net_routable             = true
      + wait_for_guest_net_timeout              = 5

      + clone {
          + linked_clone  = false
          + template_uuid = "420226ae-68b9-771b-4834-f4a360474460"
          + timeout       = 30

          + customize {
              + dns_server_list = [
                  + "172.16.11.11",
                ]
              + ipv4_gateway    = "172.16.11.1"
              + timeout         = 10

              + linux_options {
                  + domain       = "rainpole.io"
                  + host_name    = "alma01"
                  + hw_clock_utc = true
                }

              + network_interface {
                  + ipv4_netmask = 24
                }
            }
        }

      + disk {
          + attach            = false
          + controller_type   = "scsi"
          + datastore_id      = "<computed>"
          + device_address    = (known after apply)
          + disk_mode         = "persistent"
          + disk_sharing      = "sharingNone"
          + eagerly_scrub     = false
          + io_limit          = -1
          + io_reservation    = 0
          + io_share_count    = 0
          + io_share_level    = "normal"
          + keep_on_remove    = false
          + key               = 0
          + label             = "disk0"
          + path              = (known after apply)
          + size              = 40
          + storage_policy_id = (known after apply)
          + thin_provisioned  = false
          + unit_number       = 0
          + uuid              = (known after apply)
          + write_through     = false
        }
      + disk {
          + attach            = false
          + controller_type   = "scsi"
          + datastore_id      = "<computed>"
          + device_address    = (known after apply)
          + disk_mode         = "persistent"
          + disk_sharing      = "sharingNone"
          + eagerly_scrub     = false
          + io_limit          = -1
          + io_reservation    = 0
          + io_share_count    = 0
          + io_share_level    = "normal"
          + keep_on_remove    = false
          + key               = 0
          + label             = "disk1"
          + path              = (known after apply)
          + size              = 40960
          + storage_policy_id = (known after apply)
          + thin_provisioned  = true
          + unit_number       = 1
          + uuid              = (known after apply)
          + write_through     = false
        }

      + network_interface {
          + adapter_type          = "vmxnet3"
          + bandwidth_limit       = -1
          + bandwidth_reservation = 0
          + bandwidth_share_count = (known after apply)
          + bandwidth_share_level = "normal"
          + device_address        = (known after apply)
          + key                   = (known after apply)
          + mac_address           = (known after apply)
          + network_id            = "network-16"
        }
    }

Plan: 1 to add, 0 to change, 0 to destroy.
module.vm.vsphere_virtual_machine.vm[0]: Creating...
module.vm.vsphere_virtual_machine.vm[0]: Still creating... [10s elapsed]
module.vm.vsphere_virtual_machine.vm[0]: Still creating... [20s elapsed]
module.vm.vsphere_virtual_machine.vm[0]: Still creating... [30s elapsed]
module.vm.vsphere_virtual_machine.vm[0]: Still creating... [40s elapsed]
module.vm.vsphere_virtual_machine.vm[0]: Still creating... [50s elapsed]
module.vm.vsphere_virtual_machine.vm[0]: Still creating... [1m0s elapsed]
module.vm.vsphere_virtual_machine.vm[0]: Still creating... [1m10s elapsed]
module.vm.vsphere_virtual_machine.vm[0]: Still creating... [1m20s elapsed]
module.vm.vsphere_virtual_machine.vm[0]: Creation complete after 1m30s [id=42022881-6486-ad95-c293-2e58fa55eca0]

Apply complete! Resources: 1 added, 0 changed, 0 destroyed.
johnsonryan@johnsonryan-a03 ~/D/test>
```
------------

**TEST WITH CENTOS LINUX 8**

- PACKER TEMPLATE: efi-secure
- RESULT: Deployed but the Guest OS Customization **does** complete, as expected.

`main.tf`

```
provider "vsphere" {
  user = "administrator@vsphere.local"
  password = "VMware1!"
  vsphere_server = "m01-vc01.rainpole.io"
  allow_unverified_ssl = true
}

data "vsphere_datacenter" "dc" {
  name = "m01-dc01"
}

data "vsphere_compute_cluster" "cluster" {
  name          = "m01-cl01"
  datacenter_id = "${data.vsphere_datacenter.dc.id}"
}

data "vsphere_datastore" "datastore" {
  name          = "local-hdd-01"
  datacenter_id = "${data.vsphere_datacenter.dc.id}"
}

data "vsphere_virtual_machine" "template" {
  name          = "centoslinux-template"
  datacenter_id = "${data.vsphere_datacenter.dc.id}"
}

module "vm" {
  source                = "Terraform-VMWare-Modules/vm/vsphere"
  version               = "3.2.0"
  dc                    = "m01-dc01"
  vmfolder              = "Lab"
  vmtemp                = "centoslinux-template"
  vmname                = "centos"
  vmrp                  = "Lab"
  domain                = "rainpole.io"
  cpu_number            = "1"
  ram_size              = "4096"
  datastore             = "local-hdd-01"
  network = {
    "DHCP" = ["", ""]
  }
  ipv4submask = ["24"]
  network_type = ["vmxnet3"]
  
  data_disk = {
    disk1 = {
      size_gb = "40960",
      thin_provisioned = "true",
    }
  }
  dns_server_list = ["172.16.11.11"]
  vmgateway = "172.16.11.1"
  firmware  = "efi"
}
```

`terraform apply`

```
johnsonryan@johnsonryan-a03 ~/D/test> terraform apply --auto-approve

Terraform used the selected providers to generate the following execution plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # module.vm.vsphere_virtual_machine.vm[0] will be created
  + resource "vsphere_virtual_machine" "vm" {
      + boot_retry_delay                        = 10000
      + change_version                          = (known after apply)
      + cpu_limit                               = -1
      + cpu_share_count                         = (known after apply)
      + cpu_share_level                         = "normal"
      + datastore_id                            = "datastore-12"
      + default_ip_address                      = (known after apply)
      + efi_secure_boot_enabled                 = false
      + ept_rvi_mode                            = "automatic"
      + firmware                                = "efi"
      + folder                                  = "Lab"
      + force_power_off                         = true
      + guest_id                                = "centos8_64Guest"
      + guest_ip_addresses                      = (known after apply)
      + hardware_version                        = (known after apply)
      + host_system_id                          = (known after apply)
      + hv_mode                                 = "hvAuto"
      + id                                      = (known after apply)
      + ide_controller_count                    = 2
      + ignored_guest_ips                       = []
      + imported                                = (known after apply)
      + latency_sensitivity                     = "normal"
      + memory                                  = 4096
      + memory_limit                            = -1
      + memory_share_count                      = (known after apply)
      + memory_share_level                      = "normal"
      + migrate_wait_timeout                    = 30
      + moid                                    = (known after apply)
      + name                                    = "centos01"
      + num_cores_per_socket                    = 1
      + num_cpus                                = 1
      + poweron_timeout                         = 300
      + reboot_required                         = (known after apply)
      + resource_pool_id                        = "resgroup-6053"
      + run_tools_scripts_after_power_on        = true
      + run_tools_scripts_after_resume          = true
      + run_tools_scripts_before_guest_shutdown = true
      + run_tools_scripts_before_guest_standby  = true
      + sata_controller_count                   = 0
      + scsi_bus_sharing                        = "noSharing"
      + scsi_controller_count                   = 1
      + scsi_type                               = "pvscsi"
      + shutdown_wait_timeout                   = 3
      + storage_policy_id                       = (known after apply)
      + swap_placement_policy                   = "inherit"
      + uuid                                    = (known after apply)
      + vapp_transport                          = (known after apply)
      + vmware_tools_status                     = (known after apply)
      + vmx_path                                = (known after apply)
      + wait_for_guest_ip_timeout               = 0
      + wait_for_guest_net_routable             = true
      + wait_for_guest_net_timeout              = 5

      + clone {
          + linked_clone  = false
          + template_uuid = "42020738-4fce-e8ca-18f1-55009296614a"
          + timeout       = 30

          + customize {
              + dns_server_list = [
                  + "172.16.11.11",
                ]
              + ipv4_gateway    = "172.16.11.1"
              + timeout         = 10

              + linux_options {
                  + domain       = "rainpole.io"
                  + host_name    = "centos01"
                  + hw_clock_utc = true
                }

              + network_interface {
                  + ipv4_netmask = 24
                }
            }
        }

      + disk {
          + attach            = false
          + controller_type   = "scsi"
          + datastore_id      = "<computed>"
          + device_address    = (known after apply)
          + disk_mode         = "persistent"
          + disk_sharing      = "sharingNone"
          + eagerly_scrub     = false
          + io_limit          = -1
          + io_reservation    = 0
          + io_share_count    = 0
          + io_share_level    = "normal"
          + keep_on_remove    = false
          + key               = 0
          + label             = "disk0"
          + path              = (known after apply)
          + size              = 40
          + storage_policy_id = (known after apply)
          + thin_provisioned  = false
          + unit_number       = 0
          + uuid              = (known after apply)
          + write_through     = false
        }
      + disk {
          + attach            = false
          + controller_type   = "scsi"
          + datastore_id      = "<computed>"
          + device_address    = (known after apply)
          + disk_mode         = "persistent"
          + disk_sharing      = "sharingNone"
          + eagerly_scrub     = false
          + io_limit          = -1
          + io_reservation    = 0
          + io_share_count    = 0
          + io_share_level    = "normal"
          + keep_on_remove    = false
          + key               = 0
          + label             = "disk1"
          + path              = (known after apply)
          + size              = 40960
          + storage_policy_id = (known after apply)
          + thin_provisioned  = true
          + unit_number       = 1
          + uuid              = (known after apply)
          + write_through     = false
        }

      + network_interface {
          + adapter_type          = "vmxnet3"
          + bandwidth_limit       = -1
          + bandwidth_reservation = 0
          + bandwidth_share_count = (known after apply)
          + bandwidth_share_level = "normal"
          + device_address        = (known after apply)
          + key                   = (known after apply)
          + mac_address           = (known after apply)
          + network_id            = "network-16"
        }
    }

Plan: 1 to add, 0 to change, 0 to destroy.
module.vm.vsphere_virtual_machine.vm[0]: Creating...
module.vm.vsphere_virtual_machine.vm[0]: Still creating... [10s elapsed]
module.vm.vsphere_virtual_machine.vm[0]: Still creating... [20s elapsed]
module.vm.vsphere_virtual_machine.vm[0]: Still creating... [30s elapsed]
module.vm.vsphere_virtual_machine.vm[0]: Still creating... [40s elapsed]
module.vm.vsphere_virtual_machine.vm[0]: Still creating... [50s elapsed]
module.vm.vsphere_virtual_machine.vm[0]: Still creating... [1m0s elapsed]
module.vm.vsphere_virtual_machine.vm[0]: Still creating... [1m10s elapsed]
module.vm.vsphere_virtual_machine.vm[0]: Still creating... [1m20s elapsed]
module.vm.vsphere_virtual_machine.vm[0]: Still creating... [1m30s elapsed]
module.vm.vsphere_virtual_machine.vm[0]: Creation complete after 1m33s [id=42024ed1-2c00-0a87-0ed5-f7f7f4ed91ee]

Apply complete! Resources: 1 added, 0 changed, 0 destroyed.
```

----------
